Repository: python/pootle-python-org-backup
Catalog: tmxes/fr/library.tmx
Source language: en
Languages: fr

source: 2to3 - Automated Python 2 to 3 code translation
fr: 2to3 - Automatise la traduction du code de Python 2 vers Python 3

source: Using 2to3
fr: Utilisation de 2to3

source: Here is a sample Python 2.x source file, :file:`example.py`::
fr: Voici un exemple de fichier source Python 2.x, :file:`example.py`::

source: def greet(name): print "Hello, {0}!".format(name) print "What's your name?" name = raw_input() greet(name)
fr: def greet(name): print "Bonjour, {0}!".format(name) print "Quel est ton nom ?" name = raw_input() greet(name)

source: It can be converted to Python 3.x code via 2to3 on the command line::
fr: Il peut Ãªtre converti en Python 3.x via la commande 2to3::

source: def greet(name): print("Hello, {0}!".format(name)) print("What's your name?") name = input() greet(name)
fr: def greet(name): print("Bonjour, {0}!".format(name)) print("Quel est ton nom ?") name = input() greet(name)
